src/share_it/recent_reading4.zh.md

# Table of Contents

1.  [分享最近阅读的书籍清单(四)](#org0e2c009)
    1.  [绝版李鸿章](#org0b0cadc)
    2.  [How to Start a Startup](#orgefbb9df)
    3.  [Feeling Is the Secret](#org78f4ebc)
    4.  [The Game of Life and How to Play it](#org6a27019)
    5.  [Man's Search for Meaning](#orgd8aa82b)
    6.  [Eight mindful steps to happiness : walking the path of the Buddha](#org3f79466)
    7.  [How to Not Die Alone](#org79fdce9)
    8.  [The Art of Communicating](#org9f00b34)
    9.  [Inner Engineering](#orga654fb9)
    10. [Software Engineering at Google](#orgd1fa872)
2.  [写在后面](#orgf129c44)

:ID: recent-reading4


<a id="org0e2c009"></a>

# 分享最近阅读的书籍清单(四)

> 如果您希望自己周遭的一切都是熟悉的，那么您也将永远失去学到任何新东西的机会。
> 
> &#x2013;克里奇·希基

这些都是在人生中的好书藉或好内容，我想把这些优秀的东西分享出来，并赋上自己的一些主观想法，能让更多人知道并从中受益。这里只是做一个引荐，精彩需要你自己亲自拜读从中感受。


<a id="org0b0cadc"></a>

## 绝版李鸿章<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>

> 勞勞車馬未離鞍，臨事方知一死難。
> 
> 三百年來傷國步，八千里外吊民殘。
> 
> 秋風寶劍孤臣淚，落日旌旗大將壇。
> 
> 海外塵氛猶未息，請君莫作等閒看。
> 
> &#x2013;李鸿章

-   我的结论
    
    当局者迷旁观者清，有些历史人物的做法，很难被当时的人们所认同，时隔久远之后现在的我们看，在当时历史条件下很难做的比他好了。武则天为自己立了一块无字碑，想由后人评说自己的功绩，重用来俊臣是非常时期的非常手段，用完就扔了没有变成赵高的指鹿为马，有贞观遗风和开元盛世，不输在众历史皇帝。而[李鸿章](https://zh.wikipedia.org/wiki/%E6%9D%8E%E9%B4%BB%E7%AB%A0)处在一个传统与现在交替的历史特殊时期，往后退一点基本是在中原这个地盘上内斗，往前推一点就有各国势力和国际规则参与其中了，而李鸿章师从曾国潘，在这种复杂的格局下，也做到了他能做的最好的了，在当时的那个中原大陆上没有几个人的眼光，谋略和地位能超过他的了，他说一代人只能完成一代人的事，不激进也不保守，塑造了一代典范。回顾这本书的照片和介绍，管中窥豹一点这个人的瞬间，想想如果你处在他的位置，在当时内忧外患的清朝你会怎么做？


<a id="orgefbb9df"></a>

## How to Start a Startup<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>

<div class="org-center">
<p>
如何开始创业
</p>
</div>

> 从心理学的角度来看这是一个很好的方法，因为无论你执行得有多好都无法保证。话虽如此，很多“运气”都来自于你没有预料到的超出你控制范围的事情。
> 
> &#x2013;B霍洛维茨

-   我的结论
    
    首先你需要明确一点，在现在信息都可以很容易获取的时代，创业已经不在是一个天方夜谭的产物，你只需要创意的点子，正确的方向，和付诸行动的执行力。


<a id="org78f4ebc"></a>

## Feeling Is the Secret<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>

<div class="org-center">
<p>
感觉对了，就对了
</p>
</div>

> 那些无论如何能在任何艺术中完善自己的人，他能让自己为作品重复估燥确定的工作；为作品阅读很多书让艺术作品更加的迷人而不只是成为教科书。
> 
> &#x2013;俗语

-   我的结论
    
    这是一本45页的精致小书，讲述如何实现你的梦想。总共就四章，第一章规则和操作，第二章睡眠，第三章祈祷，最后一章精神－感知。这是一本关于实现你野心的艺术书，他给你提供了一系列切实有用的机制用于玩转这个世界。为什么说感觉是秘密，因为选择如何去感知这个的世界比起思考更加重要，所以请更多的去感知这个世界，这也可将改变你的人生。或许比起思考如何成功，如何挣钱，如何成为人生羸家，带给我们的压力与抑陏，让我们更多的使用感觉，他是一种顺风而听，顺水推舟，给你更真切的爱情，与更高效的工作。他不是一本成功学书，阅读他需要一定的信仰，书里有很多处引用了圣经，如果你是无神论者，或者没有任何信仰可能本书并不适合你，对于有信仰的人他们心中都有一个神圣的东西指引着自己，所以这本书也就像圣经指引着自己，解开心中诸多的疑惑。


<a id="org6a27019"></a>

## The Game of Life and How to Play it<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>

<div class="org-center">
<p>
如何玩转人生这场游戏
</p>
</div>

> 无知更容易产生信心
> 
> &#x2013;查尔斯·达尔文

-   我的结论
    
    这本书类似于[《感觉对了，就对了》](#org78f4ebc)，有宗教元素，也有意识，潜意识方面的理论，也是人生导师的书籍。市面上有很多类似的关于成功学的书，但这本出版于1925年的书可以说是这类书的早期始祖，他讲述了细节如何决定成败，以及我们犯下的错误是如何导致我们的失败。他给的答案也很简单：我们很容易从挫折中丧失信心，忘记了谁才是人生的主宰，只有我们自己和上帝，不是这个让我们沉沦的世界。而这类书的精髓在于，如果你有相同的困惑，有类似的信仰，阅读此书并结合书中总结的理论应用于现实生活，你会发现世界更加美好了。


<a id="orgd8aa82b"></a>

## Man's Search for Meaning<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup>

<div class="org-center">
<p>
活出意义来<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup>
</p>
</div>

> 我们这些曾在集中营里的人，还清楚的记得有些人穿过小屋安慰别人，把他们的最后一块面包送出去。它们可能只是极少数的个体，但他们向我们证明了：一个人的一切都有可能被夺走，但除了：在任何极端条件下选择生活的态度和方式。
> 
> &#x2013;弗兰克尔（作者）

-   我的结论
    
    这本书是来自《死亡集中营到存在主义》<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup>修定放大版，很显然是要讲一些集中营的故事，作者本人也是其中的受害者，但他并没有拘束于故事而是上升到一定的理论，创建现代精神学的意义疗法。读者能从这本书中意识到：当自己突然一无所有，再也没有什么可以失去的时候，自己应该怎么做。首先铺面而来的是冷颤，和奇怪于会有如此的命运; 其次会想尽办法保护生命中的剩余部份，尽管机会很渺茫; 最后是忍受，或是对脑海中爱人的严护、或是自己坚持的信仰、或是一个冷酷的幽默、或是瞥见了大自然的美丽一角－－一颗树一个落日、&#x2026;，让我们忍受下饥饿、屈辱，恐惧和对不公深深的愤怒。但是这些短暂的安慰并不能让这些人建立起长久活下去的意愿，除非能从这个过程中获得更大的意义，这就是意义疗法的中心主题：生命就是磨难，生存就是从磨难中找寻意义。这本书由两个部份组成，第一部份讲述了他在集中营的经历与他自己的观察，这部份读起来会让人很纠心; 第二部份解释了意义疗法作为一个治疗工具的作用。总之这是一本非常推荐的好书，不管在什么情况下，在你痛苦的时候，在你恐惧的时候，在你迷失的时候，在你开心的时候，在你有空的时候&#x2026;，都应该读读这本书。


<a id="org3f79466"></a>

## Eight mindful steps to happiness : walking the path of the Buddha<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup>

<div class="org-center">
<p>
八正道&#x2013;佛陀的安乐之道<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>
</p>
</div>

> 对自己的快乐负起责任
> 
> &#x2013;释自鼐

-   我的结论
    
    这是一本能给你带来快乐的书，他运用佛教思想归纳了八个步骤指导你获得快乐。第一正见：了解因果; 第二正思想：放下妄想放下执着；第三正语：即是不妄语，诚实和善的说话; 第四正业：告戒自己避免憎恨与暴力; 第五正命：取有道之财保持平静；第六正精进：训练自己防范于未然; 第七正念：保持警醒洞见事物; 第八正定：安定内心心一境性。这八个步骤相互作用，互相促进，彼此增进。现代的人在精神物质方面都有了更多的选择，但是却更难获得快乐了，更不用说长久持续的快乐，而你要做的就是主动走向他，对自己的快乐负起责任。这本书将深遂的佛教思想用通俗易懂的语言和可操作性教导人们如何获得真正的快乐。而有信仰的人更易于满足和获得慰藉。


<a id="org79fdce9"></a>

## How to Not Die Alone<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup>

<div class="org-center">
<p>
如何避免孤独终老<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup>
</p>
</div>

> 我们并非天生就知道如何选择合适的伴侣。美好的亲密关系是营造出来的，而不是碰运气碰来的。
> 
> &#x2013;摘要

-   我的结论
    
    本书从行为经济学、行为心理学的角度出发，解答了单身人士要如何寻找恋人、情侣如何维系亲密关系、如何评估是否应该分手、如何决定是否应该和伴侣结婚、失恋人士如何告别过去并开启新生活等一系列非常实际的情感问题。为什么现在找对象比以前更难了，因为有了社交网络可以接触到更多的人造成了攀比和绝望。运用科学方法帮助你约会，选择伴侣及分手，具有很强的实操性。这本书可能更适合一些年轻人，他们喜欢在社交网络上展示自己，喜欢从网络上获取信息包括自己的恋爱与生活，可是如今的社交网络总是浮燥的，他们耳濡目染也形成了不正确的恋爱观。而这本书让你形成正确的恋爱观，让你从无到有确定自己的对象。


<a id="org9f00b34"></a>

## The Art of Communicating<sup><a id="fnr.12" class="footref" href="#fn.12" role="doc-backlink">12</a></sup>

<div class="org-center">
<p>
諦聽與愛語 : 一行禪師談正念溝通的藝術<sup><a id="fnr.13" class="footref" href="#fn.13" role="doc-backlink">13</a></sup>
</p>
</div>

> 有效和真实的沟通有两个关键。第一是深入的倾听。第二是深情的语言。
> 
> &#x2013;摘要

-   我的结论
    
    交流的关键在于倾听，而想要别人倾听，你自己首先要学会倾听自己，就像是想要别人爱你你要先自爱。还有就是讲话要真心，所谓真心就是要说实话及亲切的语言，这样倾听人才更有可能理解和接受你的话。例如：
    1.我都在;
    2.你在这儿我很开心;
    3.我知道你的处境，这也是为什么我在这儿;
    4.我希望你能理解我的处境，我已经竭尽全力了，帮帮我;
    5.这个时刻我很开心;
    6.你也许是对的;
    这几个是在不同语境下的一些真言，它们间接的表达的你的爱意与真心，在实际生活中去套用它们，相信你也能收获真心。


<a id="orga654fb9"></a>

## Inner Engineering<sup><a id="fnr.14" class="footref" href="#fn.14" role="doc-backlink">14</a></sup>

<div class="org-center">
<p>
内在工程<sup><a id="fnr.15" class="footref" href="#fn.15" role="doc-backlink">15</a></sup>
</p>
</div>

> 正如有一门科学和技术用于创造外在幸福，也有一门完整的科学和技术用于内在幸福。”
> 
> —-萨古鲁

-   我的结论
    
    内在工程是一门源自瑜伽科学，创造内在幸福的技术。它是一门个人成长的综合课程，会改变你对生活、工作、以及所生活的世界的认知与感受。之所以会推荐他是因为看了他的一些讲学觉得很有道理让人印象深刻，继而让我对他的其他课程产生兴趣。而这样的课程之所以重要有如此众多的追随者我想正是他能真正安抚人的内心。


<a id="orgd1fa872"></a>

## Software Engineering at Google<sup><a id="fnr.16" class="footref" href="#fn.16" role="doc-backlink">16</a></sup>

<div class="org-center">
<p>
谷歌软件工程<sup><a id="fnr.17" class="footref" href="#fn.17" role="doc-backlink">17</a></sup>
</p>
</div>

> 没有什么是建立在石头上的； 一切都建立在沙子上，但我们必须把沙子当作石头来建造。
> 
> ——豪尔赫·路易斯·博尔赫斯

-   我的结论
    
    谷歌作为一头科技巨兽国内最被了解的可能是他的安卓，但是他的技术触角在国际上伸到了方方面面，从日常生活到技术依赖影响着成千上万的人。你是否曾好奇于一个庞大有效率的组织的内部结构，运作机制，管理工具等，这本书能解答你的一切疑惑以及提供一些参考价值。你可能很难用到里面的一些知识和技术，但了解一个庞大的科技公司的运作对于了解科技行业是非常有帮助的。这本书介绍建立科技组织主要围绕三个原则：1. 时效性即代码如何随着生命周期的变化而变化 2.扩展性即组织结构随着公司的扩张调整 3.权衡即在时效性和扩展性之上作何决策，整本书的章节都将会尊循这三个原则。全书章节可概括为三个: 1.文化 2.流程 3.工具。Google有他独特公司文化，团队合作，知识共享，产品衡量等，正是基于这样的文化让人们对公司有归属感，而对于大型组织文化显得尤为重要。Google公司的工作流程和协同工具的使用是基于大型的组织架构，很难套用到其他公司上，但也是有价值的参考。


<a id="orgf129c44"></a>

# 写在后面

<table id="org0b576ec" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">NO.</th>
<th scope="col" class="org-left">Content</th>
</tr>
</thead>

<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading.html">分享最近阅读的书籍清单(一)</a></td>
</tr>


<tr>
<td class="org-right">2</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading2.zh.html">分享最近阅读的书籍清单(二)</a></td>
</tr>


<tr>
<td class="org-right">3</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading3.zh.html">分享最近阅读的书籍清单(三)</a></td>
</tr>


<tr>
<td class="org-right">4</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/how_face_midnight.html">如何面对35岁</a></td>
</tr>


<tr>
<td class="org-right">5</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/share_it/recent_reading4.zh.html">分享最近阅读的书籍清单(四)</a></td>
</tr>


<tr>
<td class="org-right">6</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/why_you_should_learn_several_programming_language_and_where_to_learn_them.html">为什么你应该学习多种语言及哪里可以学到他们</a></td>
</tr>


<tr>
<td class="org-right">7</td>
<td class="org-left"><a href="https://tiglapiles.github.io/article/src/build_it/older_developer.zh.html">作为大龄程序员，你如何持续的保持自己的竞争优势</a></td>
</tr>


<tr>
<td class="org-right">8</td>
<td class="org-left">如果喜欢该文章欢迎Star我的<a href="https://github.com/tiglapiles/article">github</a></td>
</tr>


<tr>
<td class="org-right">9</td>
<td class="org-left">捐助我的<a href="https://itch.io/profile/tiglapiles">游戏</a>，支持我的创作</td>
</tr>


<tr>
<td class="org-right">10</td>
<td class="org-left"><a href="https://v2ex.com/t/884436">社区更新地址</a></td>
</tr>


<tr>
<td class="org-right">11</td>
<td class="org-left">email: <a href="mailto:tiglapiles@gmail.com">tiglapiles@gmail.com</a></td>
</tr>
</tbody>
</table>


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> <https://book.douban.com/subject/3294272/>

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://genius.com/Sam-altman-lecture-1-how-to-start-a-startup-annotated>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <http://www.feelingisthesecret.org/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://archive.org/details/gameoflifehowtop00shin/page/n5/mode/2up>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://archive.org/details/isbn_067182161x>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://book.douban.com/subject/1359005/>

<sup><a id="fn.7" href="#fnr.7">7</a></sup> <https://archive.org/details/fromdeathcamptoe0000fran/page/n141/mode/2up>

<sup><a id="fn.8" href="#fnr.8">8</a></sup> <https://archive.org/details/eightmindfulstep0000guna>

<sup><a id="fn.9" href="#fnr.9">9</a></sup> <https://book.douban.com/subject/4126251/>

<sup><a id="fn.10" href="#fnr.10">10</a></sup> <https://book.douban.com/subject/35496103/>

<sup><a id="fn.11" href="#fnr.11">11</a></sup> <https://book.douban.com/subject/35496103/>

<sup><a id="fn.12" href="#fnr.12">12</a></sup> <https://book.douban.com/subject/24834335/>

<sup><a id="fn.13" href="#fnr.13">13</a></sup> <https://book.douban.com/subject/26884896/>

<sup><a id="fn.14" href="#fnr.14">14</a></sup> <https://www.innerengineering.com/>

<sup><a id="fn.15" href="#fnr.15">15</a></sup> <https://www.innerengineering.com/zh-cn>

<sup><a id="fn.16" href="#fnr.16">16</a></sup> <https://abseil.io/resources/swe-book>

<sup><a id="fn.17" href="#fnr.17">17</a></sup> <https://book.douban.com/subject/35838155/>
